Tekla Open API Reference for Tekla Structures 2025
RebarEndDetailModifier.EndTypeEnum Enumeration
 The end type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum EndTypeEnum
Public Enumeration EndTypeEnum
Members
Member name | Value | Description
HOOK | 0 |  Hook.
CRANKING | 1 |  Cranking.
See Also
Reference
Tekla.Structures.Model Namespace